[Killed] BlockStatement
BST/index.js:2:23
 class Node {
-    constructor(data) {
-        this.data = data;
-        this.left = null;
-        this.right = null;
-    }
+    constructor(data) {}
 
     insert(data) {
killedBy: Unit test for comb sort Insertion is correct
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
BST/index.js:8:18
         this.right = null;
     }
 
-    insert(data) {
-        if (data < this.data && this.left) {
-            this.left.insert(data);
-        } else if (data < this.data) {
-            this.left = new Node(data);
-        } else if (data > this.data && this.right) {
-            this.right.insert(data);
-        } else if (data > this.data) {
-            this.right = new Node(data);
-        }
-    }
+    insert(data) {}
 
     contains(data) {
killedBy: Unit test for comb sort Insertion is correct
statusReason: TypeError: Cannot read properties of null (reading 'data')

[Killed] BlockStatement
BST/index.js:9:44
     }
 
     insert(data) {
-        if (data < this.data && this.left) {
-            this.left.insert(data);
-        } else if (data < this.data) {
+        if (data < this.data && this.left) {} else if (data < this.data) {
             this.left = new Node(data);
         } else if (data > this.data && this.right) {
killedBy: Unit test for comb sort Contains returns node with the same data
statusReason: TypeError: Cannot read properties of null (reading 'right')

[Killed] LogicalOperator
BST/index.js:9:13
     }
 
     insert(data) {
-        if (data < this.data && this.left) {
+        if (data < this.data || this.left) {
             this.left.insert(data);
         } else if (data < this.data) {
killedBy: Unit test for comb sort Insertion is correct
statusReason: TypeError: Cannot read properties of null (reading 'insert')

[Killed] BlockStatement
BST/index.js:11:38
     insert(data) {
         if (data < this.data && this.left) {
             this.left.insert(data);
-        } else if (data < this.data) {
-            this.left = new Node(data);
-        } else if (data > this.data && this.right) {
+        } else if (data < this.data) {} else if (data > this.data && this.right) {
             this.right.insert(data);
         } else if (data > this.data) {
killedBy: Unit test for comb sort Insertion is correct
statusReason: TypeError: Cannot read properties of null (reading 'data')

[Killed] ConditionalExpression
BST/index.js:11:20
     insert(data) {
         if (data < this.data && this.left) {
             this.left.insert(data);
-        } else if (data < this.data) {
+        } else if (true) {
             this.left = new Node(data);
         } else if (data > this.data && this.right) {
killedBy: Unit test for comb sort Insertion is correct
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 10
Received: 35

[Killed] LogicalOperator
BST/index.js:13:20
             this.left.insert(data);
         } else if (data < this.data) {
             this.left = new Node(data);
-        } else if (data > this.data && this.right) {
+        } else if (data > this.data || this.right) {
             this.right.insert(data);
         } else if (data > this.data) {
killedBy: Unit test for comb sort Insertion is correct
statusReason: TypeError: Cannot read properties of null (reading 'insert')

[Killed] BlockStatement
BST/index.js:13:52
             this.left.insert(data);
         } else if (data < this.data) {
             this.left = new Node(data);
-        } else if (data > this.data && this.right) {
-            this.right.insert(data);
-        } else if (data > this.data) {
+        } else if (data > this.data && this.right) {} else if (data > this.data) {
             this.right = new Node(data);
         }
killedBy: Unit test for comb sort Insertion is correct
statusReason: TypeError: Cannot read properties of null (reading 'data')

[Killed] BlockStatement
BST/index.js:15:38
             this.left = new Node(data);
         } else if (data > this.data && this.right) {
             this.right.insert(data);
-        } else if (data > this.data) {
-            this.right = new Node(data);
-        }
+        } else if (data > this.data) {}
     }
 
killedBy: Unit test for comb sort Insertion is correct
statusReason: TypeError: Cannot read properties of null (reading 'data')

[Killed] ConditionalExpression
BST/index.js:15:20
             this.left = new Node(data);
         } else if (data > this.data && this.right) {
             this.right.insert(data);
-        } else if (data > this.data) {
+        } else if (false) {
             this.right = new Node(data);
         }
killedBy: Unit test for comb sort Insertion is correct
statusReason: TypeError: Cannot read properties of null (reading 'data')

[Killed] BlockStatement
BST/index.js:20:20
         }
     }
 
-    contains(data) {
-        if (this.data === data) {
-            return this;
-        }
-
-        if (this.data < data && this.right) {
-            return this.right.contains(data);
-        } else if (this.data > data && this.left) {
-            return this.left.contains(data);
-        }
-
-        return null;
-    }
+    contains(data) {}
 }
 
killedBy: Unit test for comb sort Contains returns node with the same data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": 40, "left": null, "right": null}
Received: undefined

[Killed] EqualityOperator
BST/index.js:21:13
     }
 
     contains(data) {
-        if (this.data === data) {
+        if (this.data !== data) {
             return this;
         }
killedBy: Unit test for comb sort Contains returns node with the same data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 24

  Node {
+   "data": 20,
+   "left": Node {

[Killed] BlockStatement
BST/index.js:21:33
     }
 
     contains(data) {
-        if (this.data === data) {
-            return this;
-        }
+        if (this.data === data) {}
 
         if (this.data < data && this.right) {
killedBy: Unit test for comb sort Contains returns node with the same data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": 40, "left": null, "right": null}
Received: null

[Killed] EqualityOperator
BST/index.js:25:13
             return this;
         }
 
-        if (this.data < data && this.right) {
+        if (this.data >= data && this.right) {
             return this.right.contains(data);
         } else if (this.data > data && this.left) {
killedBy: Unit test for comb sort Contains returns node with the same data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": 40, "left": null, "right": null}
Received: null

[Killed] LogicalOperator
BST/index.js:25:13
             return this;
         }
 
-        if (this.data < data && this.right) {
+        if (this.data < data || this.right) {
             return this.right.contains(data);
         } else if (this.data > data && this.left) {
killedBy: Unit test for comb sort Contains returns node with the same data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": 8, "left": null, "right": null}
Received: null

[Killed] EqualityOperator
BST/index.js:27:20
 
         if (this.data < data && this.right) {
             return this.right.contains(data);
-        } else if (this.data > data && this.left) {
+        } else if (this.data <= data && this.left) {
             return this.left.contains(data);
         }
killedBy: Unit test for comb sort Contains returns node with the same data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": 8, "left": null, "right": null}
Received: null

[Killed] LogicalOperator
BST/index.js:27:20
 
         if (this.data < data && this.right) {
             return this.right.contains(data);
-        } else if (this.data > data && this.left) {
+        } else if (this.data > data || this.left) {
             return this.left.contains(data);
         }
killedBy: Unit test for comb sort Contains returns null if value not found
statusReason: TypeError: Cannot read properties of null (reading 'contains')
