[Killed] BlockStatement
LinkedList/index.js:3:36
 //Linked List
 class Node {
-    constructor(data, next = null) {
-      this.data = data;
-      this.next = next;
-    }
+    constructor(data, next = null) {}
   }
   
killedBy: Insert Node insertFirst: Beginning of linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: undefined

[Survived] BlockStatement
LinkedList/index.js:10:19
   }
   
   class LinkedList {
-    constructor() {
-      this.head = null;
-    }
+    constructor() {}
   
     insertFirst(data) {

[Killed] BlockStatement
LinkedList/index.js:14:23
       this.head = null;
     }
   
-    insertFirst(data) {
-      this.head = new Node(data, this.head);
-    }
+    insertFirst(data) {}
   
     size() {
killedBy: Insert Node insertFirst: Beginning of linked list
statusReason: TypeError: Cannot read properties of null (reading 'data')

[Killed] BlockStatement
LinkedList/index.js:18:12
       this.head = new Node(data, this.head);
     }
   
-    size() {
-      let counter = 0;
-      let node = this.head;
-  
-      while (node) {
-        counter++;
-        node = node.next;
-      }
-  
-      return counter;
-    }
+    size() {}
   
     getFirst() {
killedBy: Size of Linked List size: empty linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: undefined

[Timeout] BlockStatement
LinkedList/index.js:22:20
       let counter = 0;
       let node = this.head;
   
-      while (node) {
-        counter++;
-        node = node.next;
-      }
+      while (node) {}
   
       return counter;

[Killed] UpdateOperator
LinkedList/index.js:23:9
       let node = this.head;
   
       while (node) {
-        counter++;
+        counter--;
         node = node.next;
       }
killedBy: Size of Linked List size: linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 4
Received: -4

[Killed] BlockStatement
LinkedList/index.js:30:16
       return counter;
     }
   
-    getFirst() {
-      return this.head;
-    }
+    getFirst() {}
   
     getLast() {
killedBy: Get Node getFirst: Head of linked list
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
LinkedList/index.js:34:15
       return this.head;
     }
   
-    getLast() {
-      if (!this.head) {
-        return null;
-      }
-  
-      let node = this.head;
-      while (node) {
-        if (!node.next) {
-          return node;
-        }
-        node = node.next;
-      }
-    }
+    getLast() {}
   
     clear() {
killedBy: Insert Node insertLast: End of empty linked list
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] ConditionalExpression
LinkedList/index.js:35:11
     }
   
     getLast() {
-      if (!this.head) {
+      if (true) {
         return null;
       }
killedBy: Insert Node insertLast: End of empty linked list
statusReason: TypeError: Cannot read properties of null (reading 'data')

[Killed] ConditionalExpression
LinkedList/index.js:35:11
     }
   
     getLast() {
-      if (!this.head) {
+      if (false) {
         return null;
       }
killedBy: RemoveNode removeLast: single element list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: null
Received: undefined

[Killed] ConditionalExpression
LinkedList/index.js:40:14
       }
   
       let node = this.head;
-      while (node) {
+      while (false) {
         if (!node.next) {
           return node;
killedBy: Insert Node insertLast: End of empty linked list
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Timeout] BlockStatement
LinkedList/index.js:40:20
       }
   
       let node = this.head;
-      while (node) {
-        if (!node.next) {
-          return node;
-        }
-        node = node.next;
-      }
+      while (node) {}
     }
   

[Killed] ConditionalExpression
LinkedList/index.js:41:13
   
       let node = this.head;
       while (node) {
-        if (!node.next) {
+        if (false) {
           return node;
         }
killedBy: Insert Node insertLast: End of empty linked list
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
LinkedList/index.js:41:25
   
       let node = this.head;
       while (node) {
-        if (!node.next) {
-          return node;
-        }
+        if (!node.next) {}
         node = node.next;
       }
killedBy: Insert Node insertLast: End of empty linked list
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
LinkedList/index.js:48:13
       }
     }
   
-    clear() {
-      this.head = null;
-    }
+    clear() {}
   
     removeFirst() {
killedBy: Clear Makes the head null
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 2

[Killed] BlockStatement
LinkedList/index.js:52:19
       this.head = null;
     }
   
-    removeFirst() {
-      if (!this.head) {
-        return;
-      }
-  
-      this.head = this.head.next;
-    }
+    removeFirst() {}
   
     removeLast() {
killedBy: RemoveNode removeFirst: single element list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
LinkedList/index.js:53:11
     }
   
     removeFirst() {
-      if (!this.head) {
+      if (true) {
         return;
       }
killedBy: RemoveNode removeFirst: single element list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
LinkedList/index.js:53:11
     }
   
     removeFirst() {
-      if (!this.head) {
+      if (false) {
         return;
       }
killedBy: RemoveNode removeFirst : empty list
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of null (reading 'next')"

      154 |         }
      155 |       }
    > 156 |       this.head = this.head.next;

[Killed] BlockStatement
LinkedList/index.js:60:18
       this.head = this.head.next;
     }
   
-    removeLast() {
-      if (!this.head) {
-        return;
-      }
-  
-      if (!this.head.next) {
-        this.head = null;
-        return;
-      }
-  
-      let previous = this.head;
-      let node = this.head.next;
-      while (node.next) {
-        previous = node;
-        node = node.next;
-      }
-      previous.next = null;
-    }
+    removeLast() {}
   
     insertLast(data) {
killedBy: RemoveNode removeLast: single element list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
LinkedList/index.js:61:11
     }
   
     removeLast() {
-      if (!this.head) {
+      if (false) {
         return;
       }
killedBy: RemoveNode removeLast : empty list
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of null (reading 'next')"

      170 |         }
      171 |       }
    > 172 |       if (stryMutAct_9fa48("77") ? false : stryMutAct_9fa48("76") ? true : stryMutAct_9fa48("75") ? this.head.next : (stryCov_9fa48("75", "76", "77"), !this.head.next)) {

[Killed] ConditionalExpression
LinkedList/index.js:61:11
     }
   
     removeLast() {
-      if (!this.head) {
+      if (true) {
         return;
       }
killedBy: RemoveNode removeLast: single element list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
LinkedList/index.js:65:11
         return;
       }
   
-      if (!this.head.next) {
+      if (false) {
         this.head = null;
         return;
killedBy: RemoveNode removeLast: single element list
statusReason: TypeError: Cannot read properties of null (reading 'next')

[Killed] ConditionalExpression
LinkedList/index.js:65:11
         return;
       }
   
-      if (!this.head.next) {
+      if (true) {
         this.head = null;
         return;
killedBy: RemoveNode removeLast: multiple element list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
LinkedList/index.js:72:14
   
       let previous = this.head;
       let node = this.head.next;
-      while (node.next) {
+      while (false) {
         previous = node;
         node = node.next;
killedBy: RemoveNode removeLast: multiple element list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 1

[Timeout] BlockStatement
LinkedList/index.js:72:25
   
       let previous = this.head;
       let node = this.head.next;
-      while (node.next) {
-        previous = node;
-        node = node.next;
-      }
+      while (node.next) {}
       previous.next = null;
     }

[Killed] BlockStatement
LinkedList/index.js:79:22
       previous.next = null;
     }
   
-    insertLast(data) {
-      const last = this.getLast();
-  
-      if (last) {
-        // There are some existing nodes in our chain
-        last.next = new Node(data);
-      } else {
-        // The chain is empty!
-        this.head = new Node(data);
-      }
-    }
+    insertLast(data) {}
   
     getAt(index) {
killedBy: Insert Node insertLast: End of empty linked list
statusReason: TypeError: Cannot read properties of null (reading 'data')

[Killed] BlockStatement
LinkedList/index.js:82:17
     insertLast(data) {
       const last = this.getLast();
   
-      if (last) {
-        // There are some existing nodes in our chain
-        last.next = new Node(data);
-      } else {
+      if (last) {} else {
         // The chain is empty!
         this.head = new Node(data);
killedBy: Insert Node insertLast: End of empty linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
LinkedList/index.js:82:11
     insertLast(data) {
       const last = this.getLast();
   
-      if (last) {
+      if (false) {
         // There are some existing nodes in our chain
         last.next = new Node(data);
killedBy: Insert Node insertAt: End of linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 2

[Killed] BlockStatement
LinkedList/index.js:85:14
       if (last) {
         // There are some existing nodes in our chain
         last.next = new Node(data);
-      } else {
-        // The chain is empty!
-        this.head = new Node(data);
-      }
+      } else {}
     }
   
killedBy: Insert Node insertLast: End of empty linked list
statusReason: TypeError: Cannot read properties of null (reading 'data')

[Killed] BlockStatement
LinkedList/index.js:91:18
       }
     }
   
-    getAt(index) {
-      let counter = 0;
-      let node = this.head;
-      while (node) {
-        if (counter === index) {
-          return node;
-        }
-  
-        counter++;
-        node = node.next;
-      }
-      return null;
-    }
+    getAt(index) {}
   
     removeAt(index) {
killedBy: Insert Node insertAt: End of linked list
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Timeout] BlockStatement
LinkedList/index.js:94:20
     getAt(index) {
       let counter = 0;
       let node = this.head;
-      while (node) {
-        if (counter === index) {
-          return node;
-        }
-  
-        counter++;
-        node = node.next;
-      }
+      while (node) {}
       return null;
     }

[Killed] EqualityOperator
LinkedList/index.js:95:13
       let counter = 0;
       let node = this.head;
       while (node) {
-        if (counter === index) {
+        if (counter !== index) {
           return node;
         }
killedBy: Insert Node insertAt: End of linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 3

[Killed] ConditionalExpression
LinkedList/index.js:95:13
       let counter = 0;
       let node = this.head;
       while (node) {
-        if (counter === index) {
+        if (true) {
           return node;
         }
killedBy: Insert Node insertAt: End of linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 1

[Killed] UpdateOperator
LinkedList/index.js:99:9
           return node;
         }
   
-        counter++;
+        counter--;
         node = node.next;
       }
killedBy: Insert Node insertAt: End of linked list
statusReason: TypeError: Cannot read properties of null (reading 'data')

[Killed] BlockStatement
LinkedList/index.js:105:21
       return null;
     }
   
-    removeAt(index) {
-      if (!this.head) {
-        return;
-      }
-  
-      if (index === 0) {
-        this.head = this.head.next;
-        return;
-      }
-  
-      const previous = this.getAt(index - 1);
-      if (!previous || !previous.next) {
-        return;
-      }
-      previous.next = previous.next.next;
-    }
+    removeAt(index) {}
   
     insertAt(data, index) {
killedBy: RemoveNode removeAt: Beginning of linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 3

[Killed] ConditionalExpression
LinkedList/index.js:106:11
     }
   
     removeAt(index) {
-      if (!this.head) {
+      if (false) {
         return;
       }
killedBy: RemoveNode removeAt: empty list
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of null (reading 'next')"

      263 |         } else {
      264 |           stryCov_9fa48("102");
    > 265 |           this.head = this.head.next;

[Killed] BooleanLiteral
LinkedList/index.js:106:11
     }
   
     removeAt(index) {
-      if (!this.head) {
+      if (this.head) {
         return;
       }
killedBy: RemoveNode removeAt: empty list
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of null (reading 'next')"

      263 |         } else {
      264 |           stryCov_9fa48("102");
    > 265 |           this.head = this.head.next;

[Killed] ConditionalExpression
LinkedList/index.js:110:11
         return;
       }
   
-      if (index === 0) {
+      if (true) {
         this.head = this.head.next;
         return;
killedBy: RemoveNode removeAt: End of linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 3

[Killed] EqualityOperator
LinkedList/index.js:110:11
         return;
       }
   
-      if (index === 0) {
+      if (index !== 0) {
         this.head = this.head.next;
         return;
killedBy: RemoveNode removeAt: Beginning of linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 3

[Killed] ArithmeticOperator
LinkedList/index.js:115:35
         return;
       }
   
-      const previous = this.getAt(index - 1);
+      const previous = this.getAt(index + 1);
       if (!previous || !previous.next) {
         return;
killedBy: RemoveNode removeAt: End of linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 3

[Killed] ConditionalExpression
LinkedList/index.js:116:11
       }
   
       const previous = this.getAt(index - 1);
-      if (!previous || !previous.next) {
+      if (true) {
         return;
       }
killedBy: RemoveNode removeAt: End of linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 3

[Killed] ConditionalExpression
LinkedList/index.js:116:11
       }
   
       const previous = this.getAt(index - 1);
-      if (!previous || !previous.next) {
+      if (false) {
         return;
       }
killedBy: RemoveNode removeAt: Out of linked list
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of null (reading 'next')"

      276 |         }
      277 |       }
    > 278 |       previous.next = previous.next.next;

[Killed] BlockStatement
LinkedList/index.js:122:27
       previous.next = previous.next.next;
     }
   
-    insertAt(data, index) {
-      if (!this.head) {
-        this.head = new Node(data);
-        return;
-      }
-  
-      if (index === 0) {
-        this.head = new Node(data, this.head);
-        return;
-      }
-  
-      const previous = this.getAt(index - 1) || this.getLast();
-      const node = new Node(data, previous.next);
-      previous.next = node;
-    }
+    insertAt(data, index) {}
   
     forEach(fn) {
killedBy: Insert Node insertAt: Beginning of empty linked list
statusReason: TypeError: Cannot read properties of null (reading 'data')

[Killed] BooleanLiteral
LinkedList/index.js:123:11
     }
   
     insertAt(data, index) {
-      if (!this.head) {
+      if (this.head) {
         this.head = new Node(data);
         return;
killedBy: Insert Node insertAt: End of linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 3

[Killed] ConditionalExpression
LinkedList/index.js:123:11
     }
   
     insertAt(data, index) {
-      if (!this.head) {
+      if (true) {
         this.head = new Node(data);
         return;
killedBy: Insert Node insertAt: End of linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 3

[Killed] ConditionalExpression
LinkedList/index.js:128:11
         return;
       }
   
-      if (index === 0) {
+      if (false) {
         this.head = new Node(data, this.head);
         return;
killedBy: Insert Node insertAt: Beginning of linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 1

[Killed] LogicalOperator
LinkedList/index.js:133:24
         return;
       }
   
-      const previous = this.getAt(index - 1) || this.getLast();
+      const previous = this.getAt(index - 1) && this.getLast();
       const node = new Node(data, previous.next);
       previous.next = node;
killedBy: Insert Node insertAt: Middle of linked list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: 2

[Killed] ConditionalExpression
LinkedList/index.js:133:24
         return;
       }
   
-      const previous = this.getAt(index - 1) || this.getLast();
+      const previous = true;
       const node = new Node(data, previous.next);
       previous.next = node;
killedBy: Insert Node insertAt: End of linked list
statusReason: TypeError: Cannot create property 'next' on boolean 'true'

[Killed] BlockStatement
LinkedList/index.js:138:17
       previous.next = node;
     }
   
-    forEach(fn) {
-      let node = this.head;
-      let counter = 0;
-      while (node) {
-        fn(node, counter);
-        node = node.next;
-        counter++;
-      }
-    }
+    forEach(fn) {}
   
     *[Symbol.iterator]() {
killedBy: ForEach executes given function on each node
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
LinkedList/index.js:141:14
     forEach(fn) {
       let node = this.head;
       let counter = 0;
-      while (node) {
+      while (false) {
         fn(node, counter);
         node = node.next;
killedBy: ForEach executes given function on each node
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 1

[Timeout] BlockStatement
LinkedList/index.js:141:20
     forEach(fn) {
       let node = this.head;
       let counter = 0;
-      while (node) {
-        fn(node, counter);
-        node = node.next;
-        counter++;
-      }
+      while (node) {}
     }
   

[Survived] UpdateOperator
LinkedList/index.js:144:9
       while (node) {
         fn(node, counter);
         node = node.next;
-        counter++;
+        counter--;
       }
     }

[Killed] BlockStatement
LinkedList/index.js:148:26
       }
     }
   
-    *[Symbol.iterator]() {
-      let node = this.head;
-      while (node) {
-        yield node;
-        node = node.next;
-      }
-    }
+    *[Symbol.iterator]() {}
   }
   
killedBy: Default Iterator loops for of: multiple element list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 1

[Timeout] BlockStatement
LinkedList/index.js:150:20
   
     *[Symbol.iterator]() {
       let node = this.head;
-      while (node) {
-        yield node;
-        node = node.next;
-      }
+      while (node) {}
     }
   }
