[Killed] BlockStatement
Searching/index.js:2:45
 // Binary Search
-const binarySearch = (arr, itemToSearch) => {
-    let first = 0;
-    let last = arr.length - 1;
-    let mid = parseInt((first + last) / 2);
-    while (first <= last) {
-        if (itemToSearch < arr[mid]) last = mid - 1;
-        else if (itemToSearch > arr[mid]) first = mid + 1;
-        else
-            return {
-                present: true,
-                index: parseInt(mid)
-            };
-        mid = parseInt((first + last) / 2);
-    }
-    return {
-        present: false
-    };
-}
+const binarySearch = (arr, itemToSearch) => {}
 
 // Linear Search
killedBy: Testing for binary search Sorted array size 10
statusReason: TypeError: Cannot read properties of undefined (reading 'present')

[Killed] ArithmeticOperator
Searching/index.js:4:16
 // Binary Search
 const binarySearch = (arr, itemToSearch) => {
     let first = 0;
-    let last = arr.length - 1;
+    let last = arr.length + 1;
     let mid = parseInt((first + last) / 2);
     while (first <= last) {
killedBy: Testing for binary search Sorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 9
Received: 10

[Killed] ArithmeticOperator
Searching/index.js:5:25
 const binarySearch = (arr, itemToSearch) => {
     let first = 0;
     let last = arr.length - 1;
-    let mid = parseInt((first + last) / 2);
+    let mid = parseInt((first - last) / 2);
     while (first <= last) {
         if (itemToSearch < arr[mid]) last = mid - 1;
killedBy: Testing for binary search Sorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -4

[Killed] ArithmeticOperator
Searching/index.js:5:24
 const binarySearch = (arr, itemToSearch) => {
     let first = 0;
     let last = arr.length - 1;
-    let mid = parseInt((first + last) / 2);
+    let mid = parseInt((first + last) * 2);
     while (first <= last) {
         if (itemToSearch < arr[mid]) last = mid - 1;
killedBy: Testing for binary search Sorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 18

[Killed] EqualityOperator
Searching/index.js:6:12
     let first = 0;
     let last = arr.length - 1;
     let mid = parseInt((first + last) / 2);
-    while (first <= last) {
+    while (first > last) {
         if (itemToSearch < arr[mid]) last = mid - 1;
         else if (itemToSearch > arr[mid]) first = mid + 1;
killedBy: Testing for binary search Sorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Searching/index.js:6:12
     let first = 0;
     let last = arr.length - 1;
     let mid = parseInt((first + last) / 2);
-    while (first <= last) {
+    while (first < last) {
         if (itemToSearch < arr[mid]) last = mid - 1;
         else if (itemToSearch > arr[mid]) first = mid + 1;
killedBy: Testing for binary search Sorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Searching/index.js:7:13
     let last = arr.length - 1;
     let mid = parseInt((first + last) / 2);
     while (first <= last) {
-        if (itemToSearch < arr[mid]) last = mid - 1;
+        if (itemToSearch <= arr[mid]) last = mid - 1;
         else if (itemToSearch > arr[mid]) first = mid + 1;
         else
killedBy: Testing for binary search Sorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Searching/index.js:7:13
     let last = arr.length - 1;
     let mid = parseInt((first + last) / 2);
     while (first <= last) {
-        if (itemToSearch < arr[mid]) last = mid - 1;
+        if (true) last = mid - 1;
         else if (itemToSearch > arr[mid]) first = mid + 1;
         else
killedBy: Testing for binary search Sorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Searching/index.js:8:18
     let mid = parseInt((first + last) / 2);
     while (first <= last) {
         if (itemToSearch < arr[mid]) last = mid - 1;
-        else if (itemToSearch > arr[mid]) first = mid + 1;
+        else if (false) first = mid + 1;
         else
             return {
killedBy: Testing for binary search Sorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 9
Received: 4

[Killed] EqualityOperator
Searching/index.js:8:18
     let mid = parseInt((first + last) / 2);
     while (first <= last) {
         if (itemToSearch < arr[mid]) last = mid - 1;
-        else if (itemToSearch > arr[mid]) first = mid + 1;
+        else if (itemToSearch <= arr[mid]) first = mid + 1;
         else
             return {
killedBy: Testing for binary search Sorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ObjectLiteral
Searching/index.js:10:20
         if (itemToSearch < arr[mid]) last = mid - 1;
         else if (itemToSearch > arr[mid]) first = mid + 1;
         else
-            return {
-                present: true,
-                index: parseInt(mid)
-            };
+            return {};
         mid = parseInt((first + last) / 2);
     }
killedBy: Testing for binary search Sorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
Searching/index.js:11:26
         else if (itemToSearch > arr[mid]) first = mid + 1;
         else
             return {
-                present: true,
+                present: false,
                 index: parseInt(mid)
             };
killedBy: Testing for binary search Sorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Searching/index.js:14:24
                 present: true,
                 index: parseInt(mid)
             };
-        mid = parseInt((first + last) / 2);
+        mid = parseInt((first + last) * 2);
     }
     return {
killedBy: Testing for binary search Sorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 10

[Killed] ArithmeticOperator
Searching/index.js:14:25
                 present: true,
                 index: parseInt(mid)
             };
-        mid = parseInt((first + last) / 2);
+        mid = parseInt((first - last) / 2);
     }
     return {
killedBy: Testing for binary search Sorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] BooleanLiteral
Searching/index.js:17:18
         mid = parseInt((first + last) / 2);
     }
     return {
-        present: false
+        present: true
     };
 }
killedBy: Testing for binary search Sorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
Searching/index.js:22:45
 }
 
 // Linear Search
-const linearSearch = (arr, itemToSearch) => {
-    for (let i = 0; i < arr.length; i++) {
-        if (arr[i] === itemToSearch) {
-            return {
-                present: true,
-                index: i
-            };
-        }
-    }
-    return {
-        present: false
-    };
-}
+const linearSearch = (arr, itemToSearch) => {}
 
 module.exports = {
killedBy: Testing for linear search Unsorted array size 10
statusReason: TypeError: Cannot read properties of undefined (reading 'present')

[Killed] EqualityOperator
Searching/index.js:23:21
 
 // Linear Search
 const linearSearch = (arr, itemToSearch) => {
-    for (let i = 0; i < arr.length; i++) {
+    for (let i = 0; i >= arr.length; i++) {
         if (arr[i] === itemToSearch) {
             return {
killedBy: Testing for linear search Unsorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Searching/index.js:23:21
 
 // Linear Search
 const linearSearch = (arr, itemToSearch) => {
-    for (let i = 0; i < arr.length; i++) {
+    for (let i = 0; false; i++) {
         if (arr[i] === itemToSearch) {
             return {
killedBy: Testing for linear search Unsorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Searching/index.js:24:13
 // Linear Search
 const linearSearch = (arr, itemToSearch) => {
     for (let i = 0; i < arr.length; i++) {
-        if (arr[i] === itemToSearch) {
+        if (true) {
             return {
                 present: true,
killedBy: Testing for linear search Unsorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
Searching/index.js:24:13
 // Linear Search
 const linearSearch = (arr, itemToSearch) => {
     for (let i = 0; i < arr.length; i++) {
-        if (arr[i] === itemToSearch) {
+        if (false) {
             return {
                 present: true,
killedBy: Testing for linear search Unsorted array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false
