[Killed] BlockStatement
Sorting/index.js:2:34
 // Bubble Sorting
-const bubbleSort = (inputArr) => {
-    let len = inputArr.length;
-    let checked;
-    do {
-        checked = false;
-        for (let i = 0; i < len; i++) {
-            if (inputArr[i] > inputArr[i + 1]) {
-                let tmp = inputArr[i];
-                inputArr[i] = inputArr[i + 1];
-                inputArr[i + 1] = tmp;
-                checked = true;
-            }
-        }
-    } while (checked);
-    return inputArr;
-};
+const bubbleSort = (inputArr) => {};
 
 // Count Sort
killedBy: Unit test for bubble sort Empty array
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
Sorting/index.js:5:8
 const bubbleSort = (inputArr) => {
     let len = inputArr.length;
     let checked;
-    do {
-        checked = false;
-        for (let i = 0; i < len; i++) {
-            if (inputArr[i] > inputArr[i + 1]) {
-                let tmp = inputArr[i];
-                inputArr[i] = inputArr[i + 1];
-                inputArr[i + 1] = tmp;
-                checked = true;
-            }
-        }
-    } while (checked);
+    do {} while (checked);
     return inputArr;
 };
killedBy: Unit test for bubble sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Timeout] BooleanLiteral
Sorting/index.js:6:19
     let len = inputArr.length;
     let checked;
     do {
-        checked = false;
+        checked = true;
         for (let i = 0; i < len; i++) {
             if (inputArr[i] > inputArr[i + 1]) {

[Killed] ConditionalExpression
Sorting/index.js:7:25
     let checked;
     do {
         checked = false;
-        for (let i = 0; i < len; i++) {
+        for (let i = 0; false; i++) {
             if (inputArr[i] > inputArr[i + 1]) {
                 let tmp = inputArr[i];
killedBy: Unit test for bubble sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:7:39
     let checked;
     do {
         checked = false;
-        for (let i = 0; i < len; i++) {
-            if (inputArr[i] > inputArr[i + 1]) {
-                let tmp = inputArr[i];
-                inputArr[i] = inputArr[i + 1];
-                inputArr[i + 1] = tmp;
-                checked = true;
-            }
-        }
+        for (let i = 0; i < len; i++) {}
     } while (checked);
     return inputArr;
killedBy: Unit test for bubble sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:8:48
     do {
         checked = false;
         for (let i = 0; i < len; i++) {
-            if (inputArr[i] > inputArr[i + 1]) {
-                let tmp = inputArr[i];
-                inputArr[i] = inputArr[i + 1];
-                inputArr[i + 1] = tmp;
-                checked = true;
-            }
+            if (inputArr[i] > inputArr[i + 1]) {}
         }
     } while (checked);
killedBy: Unit test for bubble sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:8:17
     do {
         checked = false;
         for (let i = 0; i < len; i++) {
-            if (inputArr[i] > inputArr[i + 1]) {
+            if (false) {
                 let tmp = inputArr[i];
                 inputArr[i] = inputArr[i + 1];
killedBy: Unit test for bubble sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:10:40
         for (let i = 0; i < len; i++) {
             if (inputArr[i] > inputArr[i + 1]) {
                 let tmp = inputArr[i];
-                inputArr[i] = inputArr[i + 1];
+                inputArr[i] = inputArr[i - 1];
                 inputArr[i + 1] = tmp;
                 checked = true;
killedBy: Unit test for bubble sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:11:26
             if (inputArr[i] > inputArr[i + 1]) {
                 let tmp = inputArr[i];
                 inputArr[i] = inputArr[i + 1];
-                inputArr[i + 1] = tmp;
+                inputArr[i - 1] = tmp;
                 checked = true;
             }
killedBy: Unit test for bubble sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BooleanLiteral
Sorting/index.js:12:27
                 let tmp = inputArr[i];
                 inputArr[i] = inputArr[i + 1];
                 inputArr[i + 1] = tmp;
-                checked = true;
+                checked = false;
             }
         }
killedBy: Unit test for bubble sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:15:14
                 checked = true;
             }
         }
-    } while (checked);
+    } while (false);
     return inputArr;
 };
killedBy: Unit test for bubble sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:24:33
     const n = arr.length;
     let maxElement = 0;
 
-    for (let i = 0; i < n; i++) {
-        if (arr[i] > maxElement) {
-            maxElement = arr[i];
-        }
-    }
+    for (let i = 0; i < n; i++) {}
 
     let counts = new Array(maxElement + 1);
killedBy: Unit test for count sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:25:34
     let maxElement = 0;
 
     for (let i = 0; i < n; i++) {
-        if (arr[i] > maxElement) {
-            maxElement = arr[i];
-        }
+        if (arr[i] > maxElement) {}
     }
 
killedBy: Unit test for count sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:25:13
     let maxElement = 0;
 
     for (let i = 0; i < n; i++) {
-        if (arr[i] > maxElement) {
+        if (false) {
             maxElement = arr[i];
         }
killedBy: Unit test for count sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:30:28
         }
     }
 
-    let counts = new Array(maxElement + 1);
+    let counts = new Array(maxElement - 1);
 
     for (let i = 0; i <= maxElement; i++) {
killedBy: Unit test for count sort Empty array
statusReason: RangeError: Invalid array length

[Killed] EqualityOperator
Sorting/index.js:32:21
 
     let counts = new Array(maxElement + 1);
 
-    for (let i = 0; i <= maxElement; i++) {
+    for (let i = 0; i < maxElement; i++) {
         counts[i] = 0;
     }
killedBy: Unit test for count sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:32:43
 
     let counts = new Array(maxElement + 1);
 
-    for (let i = 0; i <= maxElement; i++) {
-        counts[i] = 0;
-    }
+    for (let i = 0; i <= maxElement; i++) {}
 
     for (let i = 0; i < n; i++) {
killedBy: Unit test for count sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:36:33
         counts[i] = 0;
     }
 
-    for (let i = 0; i < n; i++) {
-        counts[arr[i]]++;
-    }
+    for (let i = 0; i < n; i++) {}
 
     let newArray = new Array(n);
killedBy: Unit test for count sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] UpdateOperator
Sorting/index.js:37:9
     }
 
     for (let i = 0; i < n; i++) {
-        counts[arr[i]]++;
+        counts[arr[i]]--;
     }
 
killedBy: Unit test for count sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:44:21
 
     let c = 0;
 
-    for (let i = 0; i <= maxElement; i++) {
+    for (let i = 0; false; i++) {
         while (counts[i] > 0) {
             newArray[c++] = i;
killedBy: Unit test for count sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:44:21
 
     let c = 0;
 
-    for (let i = 0; i <= maxElement; i++) {
+    for (let i = 0; i > maxElement; i++) {
         while (counts[i] > 0) {
             newArray[c++] = i;
killedBy: Unit test for count sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:45:16
     let c = 0;
 
     for (let i = 0; i <= maxElement; i++) {
-        while (counts[i] > 0) {
+        while (counts[i] >= 0) {
             newArray[c++] = i;
             counts[i]--;
killedBy: Unit test for count sort Empty array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:45:16
     let c = 0;
 
     for (let i = 0; i <= maxElement; i++) {
-        while (counts[i] > 0) {
+        while (false) {
             newArray[c++] = i;
             counts[i]--;
killedBy: Unit test for count sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] UpdateOperator
Sorting/index.js:46:22
 
     for (let i = 0; i <= maxElement; i++) {
         while (counts[i] > 0) {
-            newArray[c++] = i;
+            newArray[c--] = i;
             counts[i]--;
         }
killedBy: Unit test for count sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Timeout] UpdateOperator
Sorting/index.js:47:13
     for (let i = 0; i <= maxElement; i++) {
         while (counts[i] > 0) {
             newArray[c++] = i;
-            counts[i]--;
+            counts[i]++;
         }
     }

[Killed] BlockStatement
Sorting/index.js:55:42
 };
 
 // Insertion Sort
-const insertionSort = (unsortedArray) => {
-    for (let i = 1; i < unsortedArray.length; i++) {
-        let current = unsortedArray[i];
-        let j;
-        for (j = i - 1; j >= 0 && unsortedArray[j] > current; j--) {
-            unsortedArray[j + 1] = unsortedArray[j]
-        }
-        unsortedArray[j + 1] = current;
-    }
-    return unsortedArray;
-}
+const insertionSort = (unsortedArray) => {}
 
 // Selection Sort
killedBy: Unit test for insertion sort Empty array
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
Sorting/index.js:56:52
 
 // Insertion Sort
 const insertionSort = (unsortedArray) => {
-    for (let i = 1; i < unsortedArray.length; i++) {
-        let current = unsortedArray[i];
-        let j;
-        for (j = i - 1; j >= 0 && unsortedArray[j] > current; j--) {
-            unsortedArray[j + 1] = unsortedArray[j]
-        }
-        unsortedArray[j + 1] = current;
-    }
+    for (let i = 1; i < unsortedArray.length; i++) {}
     return unsortedArray;
 }
killedBy: Unit test for insertion sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:56:21
 
 // Insertion Sort
 const insertionSort = (unsortedArray) => {
-    for (let i = 1; i < unsortedArray.length; i++) {
+    for (let i = 1; false; i++) {
         let current = unsortedArray[i];
         let j;
killedBy: Unit test for insertion sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:59:35
     for (let i = 1; i < unsortedArray.length; i++) {
         let current = unsortedArray[i];
         let j;
-        for (j = i - 1; j >= 0 && unsortedArray[j] > current; j--) {
+        for (j = i - 1; j >= 0 && true; j--) {
             unsortedArray[j + 1] = unsortedArray[j]
         }
killedBy: Unit test for insertion sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:59:25
     for (let i = 1; i < unsortedArray.length; i++) {
         let current = unsortedArray[i];
         let j;
-        for (j = i - 1; j >= 0 && unsortedArray[j] > current; j--) {
+        for (j = i - 1; false; j--) {
             unsortedArray[j + 1] = unsortedArray[j]
         }
killedBy: Unit test for insertion sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:60:27
         let current = unsortedArray[i];
         let j;
         for (j = i - 1; j >= 0 && unsortedArray[j] > current; j--) {
-            unsortedArray[j + 1] = unsortedArray[j]
+            unsortedArray[j - 1] = unsortedArray[j]
         }
         unsortedArray[j + 1] = current;
killedBy: Unit test for insertion sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:62:23
         for (j = i - 1; j >= 0 && unsortedArray[j] > current; j--) {
             unsortedArray[j + 1] = unsortedArray[j]
         }
-        unsortedArray[j + 1] = current;
+        unsortedArray[j - 1] = current;
     }
     return unsortedArray;
killedBy: Unit test for insertion sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:68:32
 }
 
 // Selection Sort
-const selectionSort = (arr) => {
-    let n = arr.length;
-
-    for (let i = 0; i < n; i++) {
-        // Set the minimum to this position.
-        min_index = i;
-
-        // Looking for a smaller number in the unsorted subarray.
-        for (let j = i + 1; j < n; j++) {
-            // If find one, set the minimum to this position.
-            if (arr[j] < arr[min_index]) {
-                min_index = j;
-            }
-        }
-
-        let temp = arr[i];
-        arr[i] = arr[min_index];
-        arr[min_index] = temp;
-    }
-    return arr;
-}
+const selectionSort = (arr) => {}
 
 // Quick Sort
killedBy: Unit test for selection sort Empty array
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
Sorting/index.js:71:33
 const selectionSort = (arr) => {
     let n = arr.length;
 
-    for (let i = 0; i < n; i++) {
-        // Set the minimum to this position.
-        min_index = i;
-
-        // Looking for a smaller number in the unsorted subarray.
-        for (let j = i + 1; j < n; j++) {
-            // If find one, set the minimum to this position.
-            if (arr[j] < arr[min_index]) {
-                min_index = j;
-            }
-        }
-
-        let temp = arr[i];
-        arr[i] = arr[min_index];
-        arr[min_index] = temp;
-    }
+    for (let i = 0; i < n; i++) {}
     return arr;
 }
killedBy: Unit test for selection sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:76:22
         min_index = i;
 
         // Looking for a smaller number in the unsorted subarray.
-        for (let j = i + 1; j < n; j++) {
+        for (let j = i - 1; j < n; j++) {
             // If find one, set the minimum to this position.
             if (arr[j] < arr[min_index]) {
killedBy: Unit test for selection sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:76:29
         min_index = i;
 
         // Looking for a smaller number in the unsorted subarray.
-        for (let j = i + 1; j < n; j++) {
+        for (let j = i + 1; false; j++) {
             // If find one, set the minimum to this position.
             if (arr[j] < arr[min_index]) {
killedBy: Unit test for selection sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:78:17
         // Looking for a smaller number in the unsorted subarray.
         for (let j = i + 1; j < n; j++) {
             // If find one, set the minimum to this position.
-            if (arr[j] < arr[min_index]) {
+            if (arr[j] >= arr[min_index]) {
                 min_index = j;
             }
killedBy: Unit test for selection sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:78:17
         // Looking for a smaller number in the unsorted subarray.
         for (let j = i + 1; j < n; j++) {
             // If find one, set the minimum to this position.
-            if (arr[j] < arr[min_index]) {
+            if (false) {
                 min_index = j;
             }
killedBy: Unit test for selection sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:91:28
 }
 
 // Quick Sort
-const quickSort = (arr) => {
-    quicksort(arr, 0, arr.length - 1);
-    return arr;
-}
+const quickSort = (arr) => {}
 
 const quicksort = (arr, start, end) => {
killedBy: Unit test for quick sort Empty array
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArithmeticOperator
Sorting/index.js:92:23
 
 // Quick Sort
 const quickSort = (arr) => {
-    quicksort(arr, 0, arr.length - 1);
+    quicksort(arr, 0, arr.length + 1);
     return arr;
 }
killedBy: Unit test for quick sort Empty array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:96:40
     return arr;
 }
 
-const quicksort = (arr, start, end) => {
-    if (start < end) {
-        let p = partition(arr, start, end);
-        quicksort(arr, 0, p - 1);
-        quicksort(arr, p + 1, end);
-
-    }
-}
+const quicksort = (arr, start, end) => {}
 
 const partition = (arr, start, end) => {
killedBy: Unit test for quick sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:97:9
 }
 
 const quicksort = (arr, start, end) => {
-    if (start < end) {
+    if (start >= end) {
         let p = partition(arr, start, end);
         quicksort(arr, 0, p - 1);
killedBy: Unit test for quick sort Empty array
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ConditionalExpression
Sorting/index.js:97:9
 }
 
 const quicksort = (arr, start, end) => {
-    if (start < end) {
+    if (true) {
         let p = partition(arr, start, end);
         quicksort(arr, 0, p - 1);
killedBy: Unit test for quick sort Empty array
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ArithmeticOperator
Sorting/index.js:99:27
 const quicksort = (arr, start, end) => {
     if (start < end) {
         let p = partition(arr, start, end);
-        quicksort(arr, 0, p - 1);
+        quicksort(arr, 0, p + 1);
         quicksort(arr, p + 1, end);
 
killedBy: Unit test for quick sort Sort array size 10
statusReason: RangeError: Maximum call stack size exceeded

[Timeout] ArithmeticOperator
Sorting/index.js:100:24
     if (start < end) {
         let p = partition(arr, start, end);
         quicksort(arr, 0, p - 1);
-        quicksort(arr, p + 1, end);
+        quicksort(arr, p - 1, end);
 
     }

[Killed] BlockStatement
Sorting/index.js:105:40
     }
 }
 
-const partition = (arr, start, end) => {
-    let p = start;
-    let pivot = arr[end];
-    for (let i = start; i < end; i++) {
-        if (arr[i] <= pivot) {
-            let temp = arr[i];
-            arr[i] = arr[p];
-            arr[p] = temp;
-            p++;
-
-        }
-    }
-    let temp = arr[p];
-    arr[p] = arr[end];
-    arr[end] = temp;
-    return p;
-}
+const partition = (arr, start, end) => {}
 
 // Merge Sort
killedBy: Unit test for quick sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:108:25
 const partition = (arr, start, end) => {
     let p = start;
     let pivot = arr[end];
-    for (let i = start; i < end; i++) {
+    for (let i = start; i <= end; i++) {
         if (arr[i] <= pivot) {
             let temp = arr[i];
killedBy: Unit test for quick sort Sort array size 10
statusReason: RangeError: Maximum call stack size exceeded

[Timeout] ConditionalExpression
Sorting/index.js:108:25
 const partition = (arr, start, end) => {
     let p = start;
     let pivot = arr[end];
-    for (let i = start; i < end; i++) {
+    for (let i = start; false; i++) {
         if (arr[i] <= pivot) {
             let temp = arr[i];

[Killed] EqualityOperator
Sorting/index.js:109:13
     let p = start;
     let pivot = arr[end];
     for (let i = start; i < end; i++) {
-        if (arr[i] <= pivot) {
+        if (arr[i] > pivot) {
             let temp = arr[i];
             arr[i] = arr[p];
killedBy: Unit test for quick sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:109:13
     let p = start;
     let pivot = arr[end];
     for (let i = start; i < end; i++) {
-        if (arr[i] <= pivot) {
+        if (true) {
             let temp = arr[i];
             arr[i] = arr[p];
killedBy: Unit test for quick sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Timeout] UpdateOperator
Sorting/index.js:113:13
             let temp = arr[i];
             arr[i] = arr[p];
             arr[p] = temp;
-            p++;
+            p--;
 
         }

[Killed] BlockStatement
Sorting/index.js:124:32
 }
 
 // Merge Sort
-const Merge = (left, right) => {
-    let resultArray = [], leftIndex = 0, rightIndex = 0;
-
-    while (leftIndex < left.length && rightIndex < right.length) {
-        if (left[leftIndex] < right[rightIndex]) {
-            resultArray.push(left[leftIndex]);
-            leftIndex++;
-        } else {
-            resultArray.push(right[rightIndex]);
-            rightIndex++;
-        }
-    }
-
-    return resultArray
-        .concat(left.slice(leftIndex))
-        .concat(right.slice(rightIndex));
-}
+const Merge = (left, right) => {}
 
 const mergeSort = (arr) => {
killedBy: Unit test for merge sort Sort array size 10
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrayDeclaration
Sorting/index.js:125:23
 
 // Merge Sort
 const Merge = (left, right) => {
-    let resultArray = [], leftIndex = 0, rightIndex = 0;
+    let resultArray = ["Stryker was here"], leftIndex = 0, rightIndex = 0;
 
     while (leftIndex < left.length && rightIndex < right.length) {
killedBy: Unit test for merge sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:127:39
 const Merge = (left, right) => {
     let resultArray = [], leftIndex = 0, rightIndex = 0;
 
-    while (leftIndex < left.length && rightIndex < right.length) {
+    while (leftIndex < left.length && rightIndex <= right.length) {
         if (left[leftIndex] < right[rightIndex]) {
             resultArray.push(left[leftIndex]);
killedBy: Unit test for merge sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:127:12
 const Merge = (left, right) => {
     let resultArray = [], leftIndex = 0, rightIndex = 0;
 
-    while (leftIndex < left.length && rightIndex < right.length) {
+    while (leftIndex >= left.length && rightIndex < right.length) {
         if (left[leftIndex] < right[rightIndex]) {
             resultArray.push(left[leftIndex]);
killedBy: Unit test for merge sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:128:13
     let resultArray = [], leftIndex = 0, rightIndex = 0;
 
     while (leftIndex < left.length && rightIndex < right.length) {
-        if (left[leftIndex] < right[rightIndex]) {
+        if (true) {
             resultArray.push(left[leftIndex]);
             leftIndex++;
killedBy: Unit test for merge sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:128:13
     let resultArray = [], leftIndex = 0, rightIndex = 0;
 
     while (leftIndex < left.length && rightIndex < right.length) {
-        if (left[leftIndex] < right[rightIndex]) {
+        if (left[leftIndex] >= right[rightIndex]) {
             resultArray.push(left[leftIndex]);
             leftIndex++;
killedBy: Unit test for merge sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] UpdateOperator
Sorting/index.js:130:13
     while (leftIndex < left.length && rightIndex < right.length) {
         if (left[leftIndex] < right[rightIndex]) {
             resultArray.push(left[leftIndex]);
-            leftIndex++;
+            leftIndex--;
         } else {
             resultArray.push(right[rightIndex]);
killedBy: Unit test for merge sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Timeout] BlockStatement
Sorting/index.js:131:16
         if (left[leftIndex] < right[rightIndex]) {
             resultArray.push(left[leftIndex]);
             leftIndex++;
-        } else {
-            resultArray.push(right[rightIndex]);
-            rightIndex++;
-        }
+        } else {}
     }
 

[Timeout] UpdateOperator
Sorting/index.js:133:13
             leftIndex++;
         } else {
             resultArray.push(right[rightIndex]);
-            rightIndex++;
+            rightIndex--;
         }
     }

[Killed] MethodExpression
Sorting/index.js:138:17
     }
 
     return resultArray
-        .concat(left.slice(leftIndex))
+        .concat(left)
         .concat(right.slice(rightIndex));
 }
killedBy: Unit test for merge sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] MethodExpression
Sorting/index.js:139:17
 
     return resultArray
         .concat(left.slice(leftIndex))
-        .concat(right.slice(rightIndex));
+        .concat(right);
 }
 
killedBy: Unit test for merge sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:142:28
         .concat(right.slice(rightIndex));
 }
 
-const mergeSort = (arr) => {
-    if (arr.length <= 1) {
-        return arr;
-    }
-
-    let middle = Math.floor(arr.length / 2);
-    let left = arr.slice(0, middle);
-    let right = arr.slice(middle);
-
-    return Merge(mergeSort(left), mergeSort(right));
-
-}
+const mergeSort = (arr) => {}
 
 // Heap Sort
killedBy: Unit test for merge sort Empty array
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
Sorting/index.js:143:9
 }
 
 const mergeSort = (arr) => {
-    if (arr.length <= 1) {
+    if (true) {
         return arr;
     }
killedBy: Unit test for merge sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:143:9
 }
 
 const mergeSort = (arr) => {
-    if (arr.length <= 1) {
+    if (arr.length > 1) {
         return arr;
     }
killedBy: Unit test for merge sort Empty array
statusReason: RangeError: Maximum call stack size exceeded

[Timeout] ArithmeticOperator
Sorting/index.js:147:29
         return arr;
     }
 
-    let middle = Math.floor(arr.length / 2);
+    let middle = Math.floor(arr.length * 2);
     let left = arr.slice(0, middle);
     let right = arr.slice(middle);

[Timeout] MethodExpression
Sorting/index.js:148:16
     }
 
     let middle = Math.floor(arr.length / 2);
-    let left = arr.slice(0, middle);
+    let left = arr;
     let right = arr.slice(middle);
 

[Timeout] MethodExpression
Sorting/index.js:149:17
 
     let middle = Math.floor(arr.length / 2);
     let left = arr.slice(0, middle);
-    let right = arr.slice(middle);
+    let right = arr;
 
     return Merge(mergeSort(left), mergeSort(right));
