[Killed] BlockStatement
Sorting/index.js:156:27
 }
 
 // Heap Sort
-const heapSort = (arr) => {
-    var N = arr.length;
-
-    // Build heap (rearrange array)
-    for (var i = Math.floor(N / 2) - 1; i >= 0; i--)
-        heapify(arr, N, i);
-
-    // One by one extract an element from heap
-    for (var i = N - 1; i > 0; i--) {
-        // Move current root to end
-        var temp = arr[0];
-        arr[0] = arr[i];
-        arr[i] = temp;
-
-        // call max heapify on the reduced heap
-        heapify(arr, i, 0);
-    }
-
-    return arr;
-}
+const heapSort = (arr) => {}
 
 // To heapify a subtree rooted with node i which is
killedBy: Unit test for heap sort Empty array
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
Sorting/index.js:160:41
     var N = arr.length;
 
     // Build heap (rearrange array)
-    for (var i = Math.floor(N / 2) - 1; i >= 0; i--)
+    for (var i = Math.floor(N / 2) - 1; false; i--)
         heapify(arr, N, i);
 
killedBy: Unit test for heap sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:160:41
     var N = arr.length;
 
     // Build heap (rearrange array)
-    for (var i = Math.floor(N / 2) - 1; i >= 0; i--)
+    for (var i = Math.floor(N / 2) - 1; i > 0; i--)
         heapify(arr, N, i);
 
killedBy: Unit test for heap sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:164:37
         heapify(arr, N, i);
 
     // One by one extract an element from heap
-    for (var i = N - 1; i > 0; i--) {
-        // Move current root to end
-        var temp = arr[0];
-        arr[0] = arr[i];
-        arr[i] = temp;
-
-        // call max heapify on the reduced heap
-        heapify(arr, i, 0);
-    }
+    for (var i = N - 1; i > 0; i--) {}
 
     return arr;
killedBy: Unit test for heap sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:164:18
         heapify(arr, N, i);
 
     // One by one extract an element from heap
-    for (var i = N - 1; i > 0; i--) {
+    for (var i = N + 1; i > 0; i--) {
         // Move current root to end
         var temp = arr[0];
killedBy: Unit test for heap sort Empty array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:179:32
 
 // To heapify a subtree rooted with node i which is
 // an index in arr[]. n is size of heap
-const heapify = (arr, N, i) => {
-    var largest = i; // Initialize largest as root
-    var l = 2 * i + 1; // left = 2*i + 1
-    var r = 2 * i + 2; // right = 2*i + 2
-
-    // If left child is larger than root
-    if (l < N && arr[l] > arr[largest])
-        largest = l;
-
-    // If right child is larger than largest so far
-    if (r < N && arr[r] > arr[largest])
-        largest = r;
-
-    // If largest is not root
-    if (largest != i) {
-        var swap = arr[i];
-        arr[i] = arr[largest];
-        arr[largest] = swap;
-
-        // Recursively heapify the affected sub-tree
-        heapify(arr, N, largest);
-    }
-}
+const heapify = (arr, N, i) => {}
 
 // Bucket Sort
killedBy: Unit test for heap sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:181:13
 // an index in arr[]. n is size of heap
 const heapify = (arr, N, i) => {
     var largest = i; // Initialize largest as root
-    var l = 2 * i + 1; // left = 2*i + 1
+    var l = 2 / i + 1; // left = 2*i + 1
     var r = 2 * i + 2; // right = 2*i + 2
 
killedBy: Unit test for heap sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:181:13
 // an index in arr[]. n is size of heap
 const heapify = (arr, N, i) => {
     var largest = i; // Initialize largest as root
-    var l = 2 * i + 1; // left = 2*i + 1
+    var l = 2 * i - 1; // left = 2*i + 1
     var r = 2 * i + 2; // right = 2*i + 2
 
killedBy: Unit test for heap sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:182:13
 const heapify = (arr, N, i) => {
     var largest = i; // Initialize largest as root
     var l = 2 * i + 1; // left = 2*i + 1
-    var r = 2 * i + 2; // right = 2*i + 2
+    var r = 2 * i - 2; // right = 2*i + 2
 
     // If left child is larger than root
killedBy: Unit test for heap sort Sort array size 10
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ArithmeticOperator
Sorting/index.js:182:13
 const heapify = (arr, N, i) => {
     var largest = i; // Initialize largest as root
     var l = 2 * i + 1; // left = 2*i + 1
-    var r = 2 * i + 2; // right = 2*i + 2
+    var r = 2 / i + 2; // right = 2*i + 2
 
     // If left child is larger than root
killedBy: Unit test for heap sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:185:9
     var r = 2 * i + 2; // right = 2*i + 2
 
     // If left child is larger than root
-    if (l < N && arr[l] > arr[largest])
+    if (l >= N && arr[l] > arr[largest])
         largest = l;
 
killedBy: Unit test for heap sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:185:9
     var r = 2 * i + 2; // right = 2*i + 2
 
     // If left child is larger than root
-    if (l < N && arr[l] > arr[largest])
+    if (false)
         largest = l;
 
killedBy: Unit test for heap sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:189:9
         largest = l;
 
     // If right child is larger than largest so far
-    if (r < N && arr[r] > arr[largest])
+    if (r <= N && arr[r] > arr[largest])
         largest = r;
 
killedBy: Unit test for heap sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:189:18
         largest = l;
 
     // If right child is larger than largest so far
-    if (r < N && arr[r] > arr[largest])
+    if (r < N && true)
         largest = r;
 
killedBy: Unit test for heap sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:193:9
         largest = r;
 
     // If largest is not root
-    if (largest != i) {
+    if (false) {
         var swap = arr[i];
         arr[i] = arr[largest];
killedBy: Unit test for heap sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:193:23
         largest = r;
 
     // If largest is not root
-    if (largest != i) {
-        var swap = arr[i];
-        arr[i] = arr[largest];
-        arr[largest] = swap;
-
-        // Recursively heapify the affected sub-tree
-        heapify(arr, N, largest);
-    }
+    if (largest != i) {}
 }
 
killedBy: Unit test for heap sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:205:9
 
 // Bucket Sort
 const bucketSort = arr => {
-    if (arr.length === 0) {
+    if (true) {
         return arr;
     }
killedBy: Unit test for bucket sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:205:9
 
 // Bucket Sort
 const bucketSort = arr => {
-    if (arr.length === 0) {
+    if (arr.length !== 0) {
         return arr;
     }
killedBy: Unit test for bucket sort Empty array
statusReason: RangeError: Invalid array length

[Killed] BlockStatement
Sorting/index.js:212:39
         minValue = arr[0],
         maxValue = arr[0],
         bucketSize = 5;
-    arr.forEach(function (currentVal) {
-        if (currentVal < minValue) {
-            minValue = currentVal;
-        } else if (currentVal > maxValue) {
-            maxValue = currentVal;
-        }
-    })
+    arr.forEach(function (currentVal) {})
     let bucketCount = Math.floor((maxValue - minValue) / bucketSize) + 1;
     let allBuckets = new Array(bucketCount);
killedBy: Unit test for bucket sort Sort array size 10
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] EqualityOperator
Sorting/index.js:213:13
         maxValue = arr[0],
         bucketSize = 5;
     arr.forEach(function (currentVal) {
-        if (currentVal < minValue) {
+        if (currentVal >= minValue) {
             minValue = currentVal;
         } else if (currentVal > maxValue) {
killedBy: Unit test for bucket sort Sort array size 10
statusReason: RangeError: Invalid array length

[Killed] ConditionalExpression
Sorting/index.js:213:13
         maxValue = arr[0],
         bucketSize = 5;
     arr.forEach(function (currentVal) {
-        if (currentVal < minValue) {
+        if (true) {
             minValue = currentVal;
         } else if (currentVal > maxValue) {
killedBy: Unit test for bucket sort Sort array size 10
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] EqualityOperator
Sorting/index.js:215:20
     arr.forEach(function (currentVal) {
         if (currentVal < minValue) {
             minValue = currentVal;
-        } else if (currentVal > maxValue) {
+        } else if (currentVal <= maxValue) {
             maxValue = currentVal;
         }
killedBy: Unit test for bucket sort Sort array size 10
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
Sorting/index.js:215:43
     arr.forEach(function (currentVal) {
         if (currentVal < minValue) {
             minValue = currentVal;
-        } else if (currentVal > maxValue) {
-            maxValue = currentVal;
-        }
+        } else if (currentVal > maxValue) {}
     })
     let bucketCount = Math.floor((maxValue - minValue) / bucketSize) + 1;
killedBy: Unit test for bucket sort Sort array size 10
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ArithmeticOperator
Sorting/index.js:219:23
             maxValue = currentVal;
         }
     })
-    let bucketCount = Math.floor((maxValue - minValue) / bucketSize) + 1;
+    let bucketCount = Math.floor((maxValue - minValue) / bucketSize) - 1;
     let allBuckets = new Array(bucketCount);
     for (i = 0; i < allBuckets.length; i++) {
killedBy: Unit test for bucket sort Single Element array
statusReason: RangeError: Invalid array length

[Killed] ArithmeticOperator
Sorting/index.js:219:35
             maxValue = currentVal;
         }
     })
-    let bucketCount = Math.floor((maxValue - minValue) / bucketSize) + 1;
+    let bucketCount = Math.floor((maxValue + minValue) / bucketSize) + 1;
     let allBuckets = new Array(bucketCount);
     for (i = 0; i < allBuckets.length; i++) {
killedBy: Unit test for bucket sort Sort array with neg elements
statusReason: RangeError: Invalid array length

[Killed] ArrayDeclaration
Sorting/index.js:220:22
         }
     })
     let bucketCount = Math.floor((maxValue - minValue) / bucketSize) + 1;
-    let allBuckets = new Array(bucketCount);
+    let allBuckets = new Array();
     for (i = 0; i < allBuckets.length; i++) {
         allBuckets[i] = [];
killedBy: Unit test for bucket sort Single Element array
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
Sorting/index.js:221:17
     })
     let bucketCount = Math.floor((maxValue - minValue) / bucketSize) + 1;
     let allBuckets = new Array(bucketCount);
-    for (i = 0; i < allBuckets.length; i++) {
+    for (i = 0; false; i++) {
         allBuckets[i] = [];
     }
killedBy: Unit test for bucket sort Single Element array
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
Sorting/index.js:221:45
     })
     let bucketCount = Math.floor((maxValue - minValue) / bucketSize) + 1;
     let allBuckets = new Array(bucketCount);
-    for (i = 0; i < allBuckets.length; i++) {
-        allBuckets[i] = [];
-    }
+    for (i = 0; i < allBuckets.length; i++) {}
     arr.forEach(function (currentVal) {
         allBuckets[Math.floor((currentVal - minValue) / bucketSize)].push(currentVal);
killedBy: Unit test for bucket sort Single Element array
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
Sorting/index.js:224:39
     for (i = 0; i < allBuckets.length; i++) {
         allBuckets[i] = [];
     }
-    arr.forEach(function (currentVal) {
-        allBuckets[Math.floor((currentVal - minValue) / bucketSize)].push(currentVal);
-    });
+    arr.forEach(function (currentVal) {});
     arr.length = 0;
     allBuckets.forEach(function (bucket) {
killedBy: Unit test for bucket sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:225:32
         allBuckets[i] = [];
     }
     arr.forEach(function (currentVal) {
-        allBuckets[Math.floor((currentVal - minValue) / bucketSize)].push(currentVal);
+        allBuckets[Math.floor((currentVal + minValue) / bucketSize)].push(currentVal);
     });
     arr.length = 0;
killedBy: Unit test for bucket sort Already sorted array
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ArithmeticOperator
Sorting/index.js:225:31
         allBuckets[i] = [];
     }
     arr.forEach(function (currentVal) {
-        allBuckets[Math.floor((currentVal - minValue) / bucketSize)].push(currentVal);
+        allBuckets[Math.floor((currentVal - minValue) * bucketSize)].push(currentVal);
     });
     arr.length = 0;
killedBy: Unit test for bucket sort Sort array size 10
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
Sorting/index.js:228:42
         allBuckets[Math.floor((currentVal - minValue) / bucketSize)].push(currentVal);
     });
     arr.length = 0;
-    allBuckets.forEach(function (bucket) {
-        insertion(bucket);
-        bucket.forEach(function (element) {
-            arr.push(element)
-        });
-    });
+    allBuckets.forEach(function (bucket) {});
     return arr;
 }
killedBy: Unit test for bucket sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:230:43
     arr.length = 0;
     allBuckets.forEach(function (bucket) {
         insertion(bucket);
-        bucket.forEach(function (element) {
-            arr.push(element)
-        });
+        bucket.forEach(function (element) {});
     });
     return arr;
killedBy: Unit test for bucket sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:237:26
     return arr;
 }
 
-const insertion = arr => {
-    let length = arr.length;
-    let i, j;
-    for (i = 1; i < length; i++) {
-        let temp = arr[i];
-        for (j = i - 1; j >= 0 && arr[j] > temp; j--) {
-            arr[j + 1] = arr[j];
-        }
-        arr[j + 1] = temp;
-    }
-    return arr;
-};
+const insertion = arr => {};
 
 // Odd even sort
killedBy: Unit test for bucket sort Sort array size 100
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:240:17
 const insertion = arr => {
     let length = arr.length;
     let i, j;
-    for (i = 1; i < length; i++) {
+    for (i = 1; false; i++) {
         let temp = arr[i];
         for (j = i - 1; j >= 0 && arr[j] > temp; j--) {
killedBy: Unit test for bucket sort Sort array size 100
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:240:34
 const insertion = arr => {
     let length = arr.length;
     let i, j;
-    for (i = 1; i < length; i++) {
-        let temp = arr[i];
-        for (j = i - 1; j >= 0 && arr[j] > temp; j--) {
-            arr[j + 1] = arr[j];
-        }
-        arr[j + 1] = temp;
-    }
+    for (i = 1; i < length; i++) {}
     return arr;
 };
killedBy: Unit test for bucket sort Sort array size 100
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:242:55
     let i, j;
     for (i = 1; i < length; i++) {
         let temp = arr[i];
-        for (j = i - 1; j >= 0 && arr[j] > temp; j--) {
-            arr[j + 1] = arr[j];
-        }
+        for (j = i - 1; j >= 0 && arr[j] > temp; j--) {}
         arr[j + 1] = temp;
     }
killedBy: Unit test for bucket sort Sort array size 100
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:242:18
     let i, j;
     for (i = 1; i < length; i++) {
         let temp = arr[i];
-        for (j = i - 1; j >= 0 && arr[j] > temp; j--) {
+        for (j = i + 1; j >= 0 && arr[j] > temp; j--) {
             arr[j + 1] = arr[j];
         }
killedBy: Unit test for bucket sort Sort array size 100
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:243:17
     for (i = 1; i < length; i++) {
         let temp = arr[i];
         for (j = i - 1; j >= 0 && arr[j] > temp; j--) {
-            arr[j + 1] = arr[j];
+            arr[j - 1] = arr[j];
         }
         arr[j + 1] = temp;
killedBy: Unit test for bucket sort Sort array size 100
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:245:13
         for (j = i - 1; j >= 0 && arr[j] > temp; j--) {
             arr[j + 1] = arr[j];
         }
-        arr[j + 1] = temp;
+        arr[j - 1] = temp;
     }
     return arr;
killedBy: Unit test for bucket sort Sort array size 100
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BooleanLiteral
Sorting/index.js:253:20
 // Odd even sort
 const oddEvenSort = (arr) => {
     n = arr.length
-    let isSorted = false;
+    let isSorted = true;
 
     while (!isSorted) {
killedBy: Unit test for odd even sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:255:12
     n = arr.length
     let isSorted = false;
 
-    while (!isSorted) {
+    while (false) {
         isSorted = true;
         let temp = 0;
killedBy: Unit test for odd even sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BooleanLiteral
Sorting/index.js:255:12
     n = arr.length
     let isSorted = false;
 
-    while (!isSorted) {
+    while (isSorted) {
         isSorted = true;
         let temp = 0;
killedBy: Unit test for odd even sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Timeout] BooleanLiteral
Sorting/index.js:256:20
     let isSorted = false;
 
     while (!isSorted) {
-        isSorted = true;
+        isSorted = false;
         let temp = 0;
 

[Killed] ConditionalExpression
Sorting/index.js:260:25
         let temp = 0;
 
         // Perform Bubble sort on odd indexed element
-        for (let i = 1; i <= n - 2; i = i + 2) {
+        for (let i = 1; false; i = i + 2) {
             if (arr[i] > arr[i + 1]) {
                 temp = arr[i];
killedBy: Unit test for odd even sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:260:48
         let temp = 0;
 
         // Perform Bubble sort on odd indexed element
-        for (let i = 1; i <= n - 2; i = i + 2) {
-            if (arr[i] > arr[i + 1]) {
-                temp = arr[i];
-                arr[i] = arr[i + 1];
-                arr[i + 1] = temp;
-                isSorted = false;
-            }
-        }
+        for (let i = 1; i <= n - 2; i = i + 2) {}
 
         // Perform Bubble sort on even indexed element
killedBy: Unit test for odd even sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:261:17
 
         // Perform Bubble sort on odd indexed element
         for (let i = 1; i <= n - 2; i = i + 2) {
-            if (arr[i] > arr[i + 1]) {
+            if (false) {
                 temp = arr[i];
                 arr[i] = arr[i + 1];
killedBy: Unit test for odd even sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:261:38
 
         // Perform Bubble sort on odd indexed element
         for (let i = 1; i <= n - 2; i = i + 2) {
-            if (arr[i] > arr[i + 1]) {
-                temp = arr[i];
-                arr[i] = arr[i + 1];
-                arr[i + 1] = temp;
-                isSorted = false;
-            }
+            if (arr[i] > arr[i + 1]) {}
         }
 
killedBy: Unit test for odd even sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:263:30
         for (let i = 1; i <= n - 2; i = i + 2) {
             if (arr[i] > arr[i + 1]) {
                 temp = arr[i];
-                arr[i] = arr[i + 1];
+                arr[i] = arr[i - 1];
                 arr[i + 1] = temp;
                 isSorted = false;
killedBy: Unit test for odd even sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Timeout] ArithmeticOperator
Sorting/index.js:264:21
             if (arr[i] > arr[i + 1]) {
                 temp = arr[i];
                 arr[i] = arr[i + 1];
-                arr[i + 1] = temp;
+                arr[i - 1] = temp;
                 isSorted = false;
             }

[Survived] BooleanLiteral
Sorting/index.js:265:28
                 temp = arr[i];
                 arr[i] = arr[i + 1];
                 arr[i + 1] = temp;
-                isSorted = false;
+                isSorted = true;
             }
         }

[Killed] EqualityOperator
Sorting/index.js:270:25
         }
 
         // Perform Bubble sort on even indexed element
-        for (let i = 0; i <= n - 2; i = i + 2) {
+        for (let i = 0; i < n - 2; i = i + 2) {
             if (arr[i] > arr[i + 1]) {
                 temp = arr[i];
killedBy: Unit test for odd even sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:270:25
         }
 
         // Perform Bubble sort on even indexed element
-        for (let i = 0; i <= n - 2; i = i + 2) {
+        for (let i = 0; false; i = i + 2) {
             if (arr[i] > arr[i + 1]) {
                 temp = arr[i];
killedBy: Unit test for odd even sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:271:38
 
         // Perform Bubble sort on even indexed element
         for (let i = 0; i <= n - 2; i = i + 2) {
-            if (arr[i] > arr[i + 1]) {
-                temp = arr[i];
-                arr[i] = arr[i + 1];
-                arr[i + 1] = temp;
-                isSorted = false;
-            }
+            if (arr[i] > arr[i + 1]) {}
         }
     }
killedBy: Unit test for odd even sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:271:17
 
         // Perform Bubble sort on even indexed element
         for (let i = 0; i <= n - 2; i = i + 2) {
-            if (arr[i] > arr[i + 1]) {
+            if (false) {
                 temp = arr[i];
                 arr[i] = arr[i + 1];
killedBy: Unit test for odd even sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:284:28
 }
 
 // Shell Sort
-const shellSort = (arr) => {
-    var increment = arr.length / 2;
-    while (increment > 0) {
-        for (i = increment; i < arr.length; i++) {
-            var j = i;
-            var temp = arr[i];
-
-            while (j >= increment && arr[j - increment] > temp) {
-                arr[j] = arr[j - increment];
-                j = j - increment;
-            }
-
-            arr[j] = temp;
-        }
-
-        if (increment == 2) {
-            increment = 1;
-        } else {
-            increment = parseInt(increment * 5 / 11);
-        }
-    }
-    return arr;
-}
+const shellSort = (arr) => {}
 
 // Comb Sort
killedBy: Unit test for shell sort Empty array
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Survived] ArithmeticOperator
Sorting/index.js:285:21
 
 // Shell Sort
 const shellSort = (arr) => {
-    var increment = arr.length / 2;
+    var increment = arr.length * 2;
     while (increment > 0) {
         for (i = increment; i < arr.length; i++) {

[Killed] ConditionalExpression
Sorting/index.js:286:12
 // Shell Sort
 const shellSort = (arr) => {
     var increment = arr.length / 2;
-    while (increment > 0) {
+    while (false) {
         for (i = increment; i < arr.length; i++) {
             var j = i;
killedBy: Unit test for shell sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Timeout] EqualityOperator
Sorting/index.js:286:12
 // Shell Sort
 const shellSort = (arr) => {
     var increment = arr.length / 2;
-    while (increment > 0) {
+    while (increment >= 0) {
         for (i = increment; i < arr.length; i++) {
             var j = i;

[Killed] BlockStatement
Sorting/index.js:287:50
 const shellSort = (arr) => {
     var increment = arr.length / 2;
     while (increment > 0) {
-        for (i = increment; i < arr.length; i++) {
-            var j = i;
-            var temp = arr[i];
-
-            while (j >= increment && arr[j - increment] > temp) {
-                arr[j] = arr[j - increment];
-                j = j - increment;
-            }
-
-            arr[j] = temp;
-        }
+        for (i = increment; i < arr.length; i++) {}
 
         if (increment == 2) {
killedBy: Unit test for shell sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:287:29
 const shellSort = (arr) => {
     var increment = arr.length / 2;
     while (increment > 0) {
-        for (i = increment; i < arr.length; i++) {
+        for (i = increment; false; i++) {
             var j = i;
             var temp = arr[i];
killedBy: Unit test for shell sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:291:20
             var j = i;
             var temp = arr[i];
 
-            while (j >= increment && arr[j - increment] > temp) {
+            while (false) {
                 arr[j] = arr[j - increment];
                 j = j - increment;
killedBy: Unit test for shell sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:291:20
             var j = i;
             var temp = arr[i];
 
-            while (j >= increment && arr[j - increment] > temp) {
+            while (j < increment && arr[j - increment] > temp) {
                 arr[j] = arr[j - increment];
                 j = j - increment;
killedBy: Unit test for shell sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:292:30
             var temp = arr[i];
 
             while (j >= increment && arr[j - increment] > temp) {
-                arr[j] = arr[j - increment];
+                arr[j] = arr[j + increment];
                 j = j - increment;
             }
killedBy: Unit test for shell sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false
