[Timeout] ArithmeticOperator
Sorting/index.js:293:21
 
             while (j >= increment && arr[j - increment] > temp) {
                 arr[j] = arr[j - increment];
-                j = j - increment;
+                j = j + increment;
             }
 

[Killed] ConditionalExpression
Sorting/index.js:299:13
             arr[j] = temp;
         }
 
-        if (increment == 2) {
+        if (false) {
             increment = 1;
         } else {
killedBy: Unit test for shell sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Timeout] EqualityOperator
Sorting/index.js:299:13
             arr[j] = temp;
         }
 
-        if (increment == 2) {
+        if (increment != 2) {
             increment = 1;
         } else {

[Timeout] BlockStatement
Sorting/index.js:301:16
 
         if (increment == 2) {
             increment = 1;
-        } else {
-            increment = parseInt(increment * 5 / 11);
-        }
+        } else {}
     }
     return arr;

[Killed] ArithmeticOperator
Sorting/index.js:302:34
         if (increment == 2) {
             increment = 1;
         } else {
-            increment = parseInt(increment * 5 / 11);
+            increment = parseInt(increment / 5 / 11);
         }
     }
killedBy: Unit test for shell sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Timeout] ArithmeticOperator
Sorting/index.js:302:34
         if (increment == 2) {
             increment = 1;
         } else {
-            increment = parseInt(increment * 5 / 11);
+            increment = parseInt(increment * 5 * 11);
         }
     }

[Timeout] BlockStatement
Sorting/index.js:310:38
 
 // Comb Sort
 const combSort = (arr) => {
-    const is_array_sorted = (arr) => {
-        var sorted = true;
-        for (var i = 0; i < arr.length - 1; i++) {
-            if (arr[i] > arr[i + 1]) {
-                sorted = false;
-                break;
-            }
-        }
-        return sorted;
-    }
+    const is_array_sorted = (arr) => {}
 
     var iteration_count = 0;

[Timeout] BooleanLiteral
Sorting/index.js:311:22
 // Comb Sort
 const combSort = (arr) => {
     const is_array_sorted = (arr) => {
-        var sorted = true;
+        var sorted = false;
         for (var i = 0; i < arr.length - 1; i++) {
             if (arr[i] > arr[i + 1]) {

[Killed] BlockStatement
Sorting/index.js:312:50
 const combSort = (arr) => {
     const is_array_sorted = (arr) => {
         var sorted = true;
-        for (var i = 0; i < arr.length - 1; i++) {
-            if (arr[i] > arr[i + 1]) {
-                sorted = false;
-                break;
-            }
-        }
+        for (var i = 0; i < arr.length - 1; i++) {}
         return sorted;
     }
killedBy: Unit test for comb sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:312:25
 const combSort = (arr) => {
     const is_array_sorted = (arr) => {
         var sorted = true;
-        for (var i = 0; i < arr.length - 1; i++) {
+        for (var i = 0; false; i++) {
             if (arr[i] > arr[i + 1]) {
                 sorted = false;
killedBy: Unit test for comb sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:313:17
     const is_array_sorted = (arr) => {
         var sorted = true;
         for (var i = 0; i < arr.length - 1; i++) {
-            if (arr[i] > arr[i + 1]) {
+            if (false) {
                 sorted = false;
                 break;
killedBy: Unit test for comb sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:313:38
     const is_array_sorted = (arr) => {
         var sorted = true;
         for (var i = 0; i < arr.length - 1; i++) {
-            if (arr[i] > arr[i + 1]) {
-                sorted = false;
-                break;
-            }
+            if (arr[i] > arr[i + 1]) {}
         }
         return sorted;
killedBy: Unit test for comb sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BooleanLiteral
Sorting/index.js:314:26
         var sorted = true;
         for (var i = 0; i < arr.length - 1; i++) {
             if (arr[i] > arr[i + 1]) {
-                sorted = false;
+                sorted = true;
                 break;
             }
killedBy: Unit test for comb sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Survived] ArithmeticOperator
Sorting/index.js:322:15
     }
 
     var iteration_count = 0;
-    var gap = arr.length - 2;
+    var gap = arr.length + 2;
     var decrease_factor = 1.25;
 

[Killed] ConditionalExpression
Sorting/index.js:327:12
 
     // Repeat iterations Until array is not sorted
 
-    while (!is_array_sorted(arr)) {
+    while (false) {
         // If not first gap  Calculate gap
         if (iteration_count > 0)
killedBy: Unit test for comb sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Timeout] BlockStatement
Sorting/index.js:327:35
 
     // Repeat iterations Until array is not sorted
 
-    while (!is_array_sorted(arr)) {
-        // If not first gap  Calculate gap
-        if (iteration_count > 0)
-            gap = (gap == 1) ? gap : Math.floor(gap / decrease_factor);
-
-        // Set front and back elements and increment to a gap
-        var front = 0;
-        var back = gap;
-        while (back <= arr.length - 1) {
-            // Swap the elements if they are not ordered
-
-            if (arr[front] > arr[back]) {
-                var temp = arr[front];
-                arr[front] = arr[back];
-                arr[back] = temp;
-            }
-
-            // Increment and re-run swapping
-
-            front += 1;
-            back += 1;
-        }
-        iteration_count += 1;
-    }
+    while (!is_array_sorted(arr)) {}
     return arr;
 }

[Survived] ConditionalExpression
Sorting/index.js:329:13
 
     while (!is_array_sorted(arr)) {
         // If not first gap  Calculate gap
-        if (iteration_count > 0)
+        if (true)
             gap = (gap == 1) ? gap : Math.floor(gap / decrease_factor);
 

[Survived] EqualityOperator
Sorting/index.js:329:13
 
     while (!is_array_sorted(arr)) {
         // If not first gap  Calculate gap
-        if (iteration_count > 0)
+        if (iteration_count >= 0)
             gap = (gap == 1) ? gap : Math.floor(gap / decrease_factor);
 

[Survived] ConditionalExpression
Sorting/index.js:330:20
     while (!is_array_sorted(arr)) {
         // If not first gap  Calculate gap
         if (iteration_count > 0)
-            gap = (gap == 1) ? gap : Math.floor(gap / decrease_factor);
+            gap = (false) ? gap : Math.floor(gap / decrease_factor);
 
         // Set front and back elements and increment to a gap

[Timeout] ConditionalExpression
Sorting/index.js:330:20
     while (!is_array_sorted(arr)) {
         // If not first gap  Calculate gap
         if (iteration_count > 0)
-            gap = (gap == 1) ? gap : Math.floor(gap / decrease_factor);
+            gap = (true) ? gap : Math.floor(gap / decrease_factor);
 
         // Set front and back elements and increment to a gap

[Timeout] EqualityOperator
Sorting/index.js:335:16
         // Set front and back elements and increment to a gap
         var front = 0;
         var back = gap;
-        while (back <= arr.length - 1) {
+        while (back < arr.length - 1) {
             // Swap the elements if they are not ordered
 

[Timeout] ConditionalExpression
Sorting/index.js:335:16
         // Set front and back elements and increment to a gap
         var front = 0;
         var back = gap;
-        while (back <= arr.length - 1) {
+        while (false) {
             // Swap the elements if they are not ordered
 

[Survived] EqualityOperator
Sorting/index.js:338:17
         while (back <= arr.length - 1) {
             // Swap the elements if they are not ordered
 
-            if (arr[front] > arr[back]) {
+            if (arr[front] >= arr[back]) {
                 var temp = arr[front];
                 arr[front] = arr[back];

[Timeout] BlockStatement
Sorting/index.js:338:41
         while (back <= arr.length - 1) {
             // Swap the elements if they are not ordered
 
-            if (arr[front] > arr[back]) {
-                var temp = arr[front];
-                arr[front] = arr[back];
-                arr[back] = temp;
-            }
+            if (arr[front] > arr[back]) {}
 
             // Increment and re-run swapping

[Timeout] AssignmentOperator
Sorting/index.js:346:13
 
             // Increment and re-run swapping
 
-            front += 1;
+            front -= 1;
             back += 1;
         }

[Timeout] AssignmentOperator
Sorting/index.js:347:13
             // Increment and re-run swapping
 
             front += 1;
-            back += 1;
+            back -= 1;
         }
         iteration_count += 1;

[Timeout] AssignmentOperator
Sorting/index.js:349:9
             front += 1;
             back += 1;
         }
-        iteration_count += 1;
+        iteration_count -= 1;
     }
     return arr;

[Killed] ConditionalExpression
Sorting/index.js:356:9
 
 // Pigeonhole Sort
 const pigeonholeSort = (nums) => {
-    if (nums.length == 0) return [];
+    if (true) return [];
     let min_val = nums[0]
     let max_val = nums[0]
killedBy: Unit test for pigeonhole sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:356:9
 
 // Pigeonhole Sort
 const pigeonholeSort = (nums) => {
-    if (nums.length == 0) return [];
+    if (false) return [];
     let min_val = nums[0]
     let max_val = nums[0]
killedBy: Unit test for pigeonhole sort Empty array
statusReason: RangeError: Invalid array length

[Killed] BlockStatement
Sorting/index.js:360:43
     let min_val = nums[0]
     let max_val = nums[0]
 
-    for (let i = 0; i < nums.length; i++) {
-        if (nums[i] > max_val) { max_val = nums[i] }
-        if (nums[i] < min_val) { min_val = nums[i] }
-    }
+    for (let i = 0; i < nums.length; i++) {}
 
     const range = max_val - min_val + 1
killedBy: Unit test for pigeonhole sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:360:21
     let min_val = nums[0]
     let max_val = nums[0]
 
-    for (let i = 0; i < nums.length; i++) {
+    for (let i = 0; i >= nums.length; i++) {
         if (nums[i] > max_val) { max_val = nums[i] }
         if (nums[i] < min_val) { min_val = nums[i] }
killedBy: Unit test for pigeonhole sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:361:13
     let max_val = nums[0]
 
     for (let i = 0; i < nums.length; i++) {
-        if (nums[i] > max_val) { max_val = nums[i] }
+        if (true) { max_val = nums[i] }
         if (nums[i] < min_val) { min_val = nums[i] }
     }
killedBy: Unit test for pigeonhole sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:361:13
     let max_val = nums[0]
 
     for (let i = 0; i < nums.length; i++) {
-        if (nums[i] > max_val) { max_val = nums[i] }
+        if (false) { max_val = nums[i] }
         if (nums[i] < min_val) { min_val = nums[i] }
     }
killedBy: Unit test for pigeonhole sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Sorting/index.js:362:13
 
     for (let i = 0; i < nums.length; i++) {
         if (nums[i] > max_val) { max_val = nums[i] }
-        if (nums[i] < min_val) { min_val = nums[i] }
+        if (false) { min_val = nums[i] }
     }
 
killedBy: Unit test for pigeonhole sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:362:32
 
     for (let i = 0; i < nums.length; i++) {
         if (nums[i] > max_val) { max_val = nums[i] }
-        if (nums[i] < min_val) { min_val = nums[i] }
+        if (nums[i] < min_val) {}
     }
 
killedBy: Unit test for pigeonhole sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:365:19
         if (nums[i] < min_val) { min_val = nums[i] }
     }
 
-    const range = max_val - min_val + 1
+    const range = max_val + min_val + 1
     const data = Array(range).fill(0)
 
killedBy: Unit test for pigeonhole sort Sort array with neg elements
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:365:19
         if (nums[i] < min_val) { min_val = nums[i] }
     }
 
-    const range = max_val - min_val + 1
+    const range = max_val - min_val - 1
     const data = Array(range).fill(0)
 
killedBy: Unit test for pigeonhole sort Single Element array
statusReason: RangeError: Invalid array length

[Killed] ConditionalExpression
Sorting/index.js:368:21
     const range = max_val - min_val + 1
     const data = Array(range).fill(0)
 
-    for (let i = 0; i < nums.length; i++) {
+    for (let i = 0; false; i++) {
         data[nums[i] - min_val]++
     }
killedBy: Unit test for pigeonhole sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] UpdateOperator
Sorting/index.js:369:9
     const data = Array(range).fill(0)
 
     for (let i = 0; i < nums.length; i++) {
-        data[nums[i] - min_val]++
+        data[nums[i] - min_val]--
     }
 
killedBy: Unit test for pigeonhole sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:369:14
     const data = Array(range).fill(0)
 
     for (let i = 0; i < nums.length; i++) {
-        data[nums[i] - min_val]++
+        data[nums[i] + min_val]++
     }
 
killedBy: Unit test for pigeonhole sort Sort array size 100
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:374:37
 
     let index = 0
 
-    for (let j = 0; j < range; j++) {
-        while (data[j]-- > 0) {
-            nums[index++] = j + min_val
-        }
-    }
+    for (let j = 0; j < range; j++) {}
     return nums
 }
killedBy: Unit test for pigeonhole sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:374:21
 
     let index = 0
 
-    for (let j = 0; j < range; j++) {
+    for (let j = 0; j >= range; j++) {
         while (data[j]-- > 0) {
             nums[index++] = j + min_val
killedBy: Unit test for pigeonhole sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Sorting/index.js:375:31
     let index = 0
 
     for (let j = 0; j < range; j++) {
-        while (data[j]-- > 0) {
-            nums[index++] = j + min_val
-        }
+        while (data[j]-- > 0) {}
     }
     return nums
killedBy: Unit test for pigeonhole sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
Sorting/index.js:375:16
     let index = 0
 
     for (let j = 0; j < range; j++) {
-        while (data[j]-- > 0) {
+        while (data[j]-- >= 0) {
             nums[index++] = j + min_val
         }
killedBy: Unit test for pigeonhole sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
Sorting/index.js:376:29
 
     for (let j = 0; j < range; j++) {
         while (data[j]-- > 0) {
-            nums[index++] = j + min_val
+            nums[index++] = j - min_val
         }
     }
killedBy: Unit test for pigeonhole sort Single Element array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] UpdateOperator
Sorting/index.js:376:18
 
     for (let j = 0; j < range; j++) {
         while (data[j]-- > 0) {
-            nums[index++] = j + min_val
+            nums[index--] = j + min_val
         }
     }
killedBy: Unit test for pigeonhole sort Sort array size 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ObjectLiteral
Sorting/index.js:383:18
 }
 
 
-module.exports = {
-    bubbleSort,
-    countSort,
-    insertionSort,
-    selectionSort,
-    quickSort,
-    mergeSort,
-    heapSort,
-    bucketSort,
-    oddEvenSort,
-    shellSort,
-    combSort,
-    pigeonholeSort
-};
+module.exports = {};
killedBy: Unit test for bubble sort Empty array
statusReason: TypeError: bubbleSort is not a function
