[Killed] BlockStatement
Strings/index.js:1:35
-const isAnagram = (str1, str2) => {
-    if (str1.length !== str2.length) {
-        return false
-    } else {
-        return str1.split('').sort().join('') === str2.split('').sort().join('');
-    }
-}
+const isAnagram = (str1, str2) => {}
 
 const reverseString = (str) => {
killedBy: Testing for anagrams Strings are anagram
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: undefined

[Killed] EqualityOperator
Strings/index.js:2:9
 const isAnagram = (str1, str2) => {
-    if (str1.length !== str2.length) {
+    if (str1.length === str2.length) {
         return false
     } else {
killedBy: Testing for anagrams Strings are anagram
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
Strings/index.js:2:9
 const isAnagram = (str1, str2) => {
-    if (str1.length !== str2.length) {
+    if (true) {
         return false
     } else {
killedBy: Testing for anagrams Strings are anagram
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BooleanLiteral
Strings/index.js:3:16
 const isAnagram = (str1, str2) => {
     if (str1.length !== str2.length) {
-        return false
+        return true
     } else {
         return str1.split('').sort().join('') === str2.split('').sort().join('');
killedBy: Testing for anagrams Strings are of different length
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
Strings/index.js:4:12
 const isAnagram = (str1, str2) => {
     if (str1.length !== str2.length) {
         return false
-    } else {
-        return str1.split('').sort().join('') === str2.split('').sort().join('');
-    }
+    } else {}
 }
 
killedBy: Testing for anagrams Strings are anagram
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
Strings/index.js:5:16
     if (str1.length !== str2.length) {
         return false
     } else {
-        return str1.split('').sort().join('') === str2.split('').sort().join('');
+        return true;
     }
 }
killedBy: Testing for anagrams Strings are not anagram
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
Strings/index.js:5:16
     if (str1.length !== str2.length) {
         return false
     } else {
-        return str1.split('').sort().join('') === str2.split('').sort().join('');
+        return false;
     }
 }
killedBy: Testing for anagrams Strings are anagram
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
Strings/index.js:9:32
     }
 }
 
-const reverseString = (str) => {
-    return str.split("").reverse().join("");
-}
+const reverseString = (str) => {}
 
 
killedBy: Testing for reverse string String is reversed
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "enalp"
Received: undefined

[Killed] MethodExpression
Strings/index.js:10:12
 }
 
 const reverseString = (str) => {
-    return str.split("").reverse().join("");
+    return str.split("").join("");
 }
 
killedBy: Testing for reverse string String is reversed
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "enalp"
Received: "plane"
