[Killed] BlockStatement
Tree/index.js:2:23
 class Node {
-    constructor(data) {
-      this.data = data;
-      this.children = [];
-    }
+    constructor(data) {}
     add(data) {
       this.children.push(new Node(data));
killedBy: Node Data and Children
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] BlockStatement
Tree/index.js:6:15
       this.data = data;
       this.children = [];
     }
-    add(data) {
-      this.children.push(new Node(data));
-    }
+    add(data) {}
     remove(data) {
       this.children = this.children.filter((node) => {
killedBy: Node Add children
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] BlockStatement
Tree/index.js:9:18
     add(data) {
       this.children.push(new Node(data));
     }
-    remove(data) {
-      this.children = this.children.filter((node) => {
-        return node.data !== data;
-      });
-    }
+    remove(data) {}
 }
 
killedBy: Node Remove children
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] BlockStatement
Tree/index.js:10:54
       this.children.push(new Node(data));
     }
     remove(data) {
-      this.children = this.children.filter((node) => {
-        return node.data !== data;
-      });
+      this.children = this.children.filter((node) => {});
     }
 }
killedBy: Node Remove children: wrong element
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] MethodExpression
Tree/index.js:10:23
       this.children.push(new Node(data));
     }
     remove(data) {
-      this.children = this.children.filter((node) => {
-        return node.data !== data;
-      });
+      this.children = this.children;
     }
 }
killedBy: Node Remove children
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] EqualityOperator
Tree/index.js:11:16
     }
     remove(data) {
       this.children = this.children.filter((node) => {
-        return node.data !== data;
+        return node.data === data;
       });
     }
killedBy: Node Remove children
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
Tree/index.js:11:16
     }
     remove(data) {
       this.children = this.children.filter((node) => {
-        return node.data !== data;
+        return false;
       });
     }
killedBy: Node Remove children: wrong element
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] BlockStatement
Tree/index.js:17:19
 }
 
 class Tree {
-    constructor() {
-      this.root = null;
-    }
+    constructor() {}
     traverseBF(fn){
         const arr=[this.root];
killedBy: Tree Empty Tree
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: null
Received: undefined

[Killed] BlockStatement
Tree/index.js:20:19
     constructor() {
       this.root = null;
     }
-    traverseBF(fn){
-        const arr=[this.root];
-        while(arr.length){
-        const node = arr.shift();
-        arr.push(...node.children);
-        fn(node);
-        }
-    }
+    traverseBF(fn){}
     traverseDF(fn){
         const arr =[this.root];
killedBy: Tree traverseBF
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   1,
-   2,

[Killed] ConditionalExpression
Tree/index.js:22:15
     }
     traverseBF(fn){
         const arr=[this.root];
-        while(arr.length){
+        while(false){
         const node = arr.shift();
         arr.push(...node.children);
killedBy: Tree traverseBF
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   1,
-   2,

[Timeout] BlockStatement
Tree/index.js:22:26
     }
     traverseBF(fn){
         const arr=[this.root];
-        while(arr.length){
-        const node = arr.shift();
-        arr.push(...node.children);
-        fn(node);
-        }
+        while(arr.length){}
     }
     traverseDF(fn){

[Killed] BlockStatement
Tree/index.js:28:19
         fn(node);
         }
     }
-    traverseDF(fn){
-        const arr =[this.root];
-        while(arr.length){
-        const node=arr.shift();
-        arr.unshift(...node.children)
-        fn(node);
-        }
-    }
+    traverseDF(fn){}
 }
 module.exports = { Tree, Node };
killedBy: Tree traverseDF
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   1,
-   2,

[Timeout] BlockStatement
Tree/index.js:30:26
     }
     traverseDF(fn){
         const arr =[this.root];
-        while(arr.length){
-        const node=arr.shift();
-        arr.unshift(...node.children)
-        fn(node);
-        }
+        while(arr.length){}
     }
 }
